<template>
    <div id="imOnlyHuman" class="container">
        <Card 
            v-for="data of card_data"
            :key="data.id"
            :data="data"
        />
    </div>
</template>   
<script>
import Card from '@/components/Block_01_card.vue' 
export default {
    data(){
        return {
            card_data: [
                {id: 0, title: 'Есть человек', url: '', image: require('@/assets/images/01_block_01_img.png'), content: 'Существует человек с поднятой головой и твёрдой поступью. <br/>Существует человек, у которого в глазах отражается внутренний огонь. Блеск жизни. <br/><br/>Он полон энергии, неистощим. Вокруг него разрастается мир, он созидает его собственными силами.<br/> Он стремителен и движется без сомнений в верности своих действий. Его невозможно остановить.<br/> Он наслаждается каждым шагом. <br/><br/>Он ~ путёвый.<br/> <br/> Путёвый видит впереди идеалы благодаря детской способности мечтать.<br/> Путёвый знает реальность благодаря детскому любопытству.<br/> Жажда жизни путёвого требует движения, роста, развития.<br/> <br/> Оставаясь верным своему Я, самому себе, внутреннему голосу, <br/>в высшей степени путёвый справляется с преградами мира и стремится знать и видеть, чтобы творить!<br/> <br/> Слышишь, что звучит внутри?<br/> Может это ты?<br/>' }, 
                {id: 1, title: 'Может и нет', url: '/vk', image: require('@/assets/images/01_block_02_img.png'), content: 'Сначала люди игнорируют внутренний голос в вопросе, который «не стоит внимания»,<br />потом непутёвые не могут услышать себя, когда это необходимо.<br/> С каждым годом непутёвые отдаляются от своих идеалов, пока не теряют себя окончательно...<br/> <br/>Пока непутёвый не перешёл грань и не стал потерянным, он ещё может вернуть себя.<br/> <br/>Я исследую то, как человек сохраняет собственное Я, что заставляет человека отказываться от себя, <br/>какие шаги возвращают внутренний голос и как можно содействовать другому <strong>быть собой</strong>.<br/> <br/>Я работаю с человеческим самоопределением.<br/> Я желаю, чтобы ты знал ответ на вопрос «Кто Я?».'}
            ],
        }
    },
    components: {
        Card
    }
}
</script>

<style>

</style>