<template>
    <div class="container">
        <div class="page-card">
            <Card 
                v-for="data of card_data"
                v-bind:data="data"
                v-bind:key="data.id"
            />
        </div>
    </div>
</template>

<script>
import Card from '@/components/Pages_Card.vue' 
export default {
    data(){
        return {
            card_data: [
                {id: 0, title: 'Длинная дистанция', content: 'Фраза «будь собой» ясна, не вызывает разночтений в своей сути, не вызывает недопониманий, <br/>только человек доходит до вопроса к самому себе: «Как это»? <br/>Близость смысла фразы к истине даёт понять, что это естественное, необходимое и энергоэффективное состояние человека. <br/>Идея подразумевает, что каждый знает ответы на вопросы: «Что значит быть собой?» и «Как Я должен действовать?» <br/>(и извне никто ответить не способен).<br/>Однако мы живём в обществе, где людей, сохранивших это базовое состояние личности, нужно с ювелирным вниманием отыскивать. <br/>А вот непутёвые, потерянные и умершие наводняют мир ~ хочется бежать от них.<br/><br/>Человеческая история и наше время испещрено ложными взглядами и идеями, которые приводят к потере у человека связи со своим нутром. Полагаясь на народную мудрость, традиции, взгляды квазиопытных и старых, можно прийти к известному результату: стать не самим собой, <br/>а кем-то другим ~ <Strong>чужим</Strong>.<br/><br/> Фраза «будь собой» подразумевает, что лучшее, что может сделать человек ~ это полагаться на себя, а не на чужого. Однако на сегодняшний день <br/>это одна из самых труднейших задач, так как с раннего детства человек подвергается внушению со стороны родственников, воспитателей, учителей, политиков, контентмейкеров и других носителей искалеченного уклада ~ «будь чужим». <br/><br/>Реализуй общественные стереотипы. На привыкание к такой модели уходят десятилетия бессознательного, <br/>безбарьерного восприятия и авторитарного давления старой интеллигенции.<br/> <br/>Важно понять, что для перехода от состояния «быть чужим» до состояния «быть собой», необходимо трудиться в длительной перспективе. <br/> <br/>И для того, чтобы хватило энергии пройти путь от начала до конца, разгадывая загадку «Как?», принципиально ответить на вопрос: «Зачем?».' },
                {id: 1, title: 'Выбор', content: 'Жизнь часто ставит человека перед выбором: действовать, сохраняя себя, с трудом и необходимостью защищать свою позицию, свои принципы <br/>и идеалы, порой теряя друзей и облучаясь общественным неодобрением, или поддаться социальным вкусам и запросам, играя роль, чтобы не создать конфликт, сохранить взаимоотношения и уважить авторитет.<br/><br/> Человек, действующий вопреки своему внутреннему миру в пользу внешних требований ~ чувствует боль, огорчение и предательство самого себя.<br/><br/> Человек ощущает, что проиграл. И к этой боли невозможно привыкнуть, её лишь можно попробовать не замечать, постепенно наполняя свою жизнь страданием. Но непутёвый из раза в раз идёт на эту сделку с дьяволом: сначала из-за веры, что компромисс с обществом необходим («только так можно встроиться в систему»), и надежды, что боль с каждым разом будет утихать; а после, когда надежды рушатся, идёт на сделку автоматически, <br/>по привычке, и уже от слабости, так как предательство своего существа приводит к глубокому энергетическому истощению.<br/><br/> <Strong>Предателем невозможно быть «чуть-чуть», невозможно слегка предать.</Strong><br/><br/> Первое, что требует боль предательства ~ это осмыслить проблему, найти причину и больше никогда не истощать внутренний источник.'},
                {id: 2, title: 'Преимущества', content: '<Strong>Если человек является собой ~ он способен быть счастливым, свободным и цельным.</Strong><br/><br/> Даже тот, кто не замечает, что предаёт себя, или делает это сознательно, стремится к счастью. Но, чтобы быть во внутренних состояниях, необходимо быть внутри. <br/><br/> Необходимо быть внимательным и заботливым к внутреннему голосу, который отчётливо говорит «НЕТ!» и который требует определённых действий, отказ от которых равнозначен предательству. Чтобы не чувствовать боль, непутёвые маскируют проблему, создают удобный самообман, обосновывая лень, трусость, унижающий страх…<br/><br/><Strong>Самообман не решает проблему, он лишь откладывает страдания, которые принесёт предательство</Strong><br/><br/> Реальность такова, что быть абсолютно верным своему внутреннему голосу ~ минимальное условие для обретения счастья, свободы и цельности.<br/> И только в таком состоянии возможна жизнь для разумного существа, человека.<br/><br/> Вопрос «быть собой» ~ это буквально вопрос жизни и смерти.'},
                {id: 3, title: 'Последствия', content: 'Только выбор в пользу себя способен принести жизнь отдельному человеку.<br/> И только живой человек способен внести свой посильный вклад в улучшение мира и общества.<br/><br/> Находясь в самом энергетически ёмком состоянии, увлекаясь делом, реализуя максимум внутреннего потенциала, таланта и способностей, человек приносит предельный вклад в историю человечества. Достичь этих условий невозможно без выбора в пользу себя. Другие люди, если они ценят рост <br/>и развитие, заинтересованы в сохранении самих себя и в условиях, при которых никто не мешает сохранять себя человеку.<br/><br/> В мире цельный человек своим существованием вдохновляет молодых, запуская цепную реакцию роста и развития.<br/><br/> <Strong>«Мне не нужны ни служители, ни те, кому служат; ни алтари, ни жертвоприношения, лишь высшее, совершенное, не ведающее боли. <br/> Не помогайте мне, не служите мне, но позвольте увидеть это, потому что я в нём нуждаюсь. Не трудитесь ради моего счастья, братья, покажите мне своё счастье ~ покажите, что оно возможно, покажите мне ваши свершения ~ и это даст мне мужество увидеть моё»</Strong> <br/><br/> (Эйн Рэнд, «Источник» в пер. Костыгина).'},            
            ],
        }
    },
    components: {
        Card
    }
}
</script>

<style>
    
</style>