<template>
    <div class="container">
        <div class="page-card">
            <Card 
                v-for="data of card_data"
                v-bind:data="data"
                v-bind:key="data.id"
            />
        </div>
    </div>
</template>

<script>
import Card from '@/components/Pages_Card.vue' 
export default {
    data(){
        return {
            card_data: [
                {id: 0, title: 'Идеал двигает', content: 'Фундаментальный первый шаг человека в предательстве себя ~ это отказ от идеалов. <br />От мечтательности, потому что в детстве над мечтой слащаво умилялись, от героизма, потому что «жизнь полна несправедливости» и «добро побеждает только в сказках», от жажды сделать мир лучше, потому что «всё тлен».<br /><br /> Идеализм с детства до получения красной картонки рубится под корень. Идеалы равняют с фанатизмом, наивностью и безрассудством, упрекая носителя. Идеалы осуждают, как крайность, не вдаваясь в подробности, что лежит на другой чаше весов, и требуют соблюдать нейтралитет и идти <br />на компромисс. Идеалы списывают на подростковый максимализм, с ехидством оценивая убеждённость молодых ~ как нечто, что <Strong>проходит</Strong>.<br /><br /> И в большинстве своём способность конструировать идеалы у людей действительно пропадает, а тот, кто остаётся верен идеалу, сталкивается <br />на постоянной основе с высокомерной и циничной иронией ~ <Strong>идеалист</Strong>.<br /><br /> Однако, если отрицать и высмеивать наивность в младенчестве, мечтательность в детстве, героизм в юношестве и максимализм в молодости, угнетается способность человека к стремлению. Человек в процессе становления учится стремиться и достигать. Невозможно достигать, отказываясь стремиться. В чём действительно нуждается молодой человек, так это в инструментах отличить реалистичное стремление от фантазии.<br />' },
                {id: 1, title: 'Идеалист = Реалист', content: '<Strong>Идеал ~ это реалистичный образ будущего, определяющий шаги для достижения и формирующий стремления</Strong><br /><br /> Идеал первым делом требует от человека разобраться в реальности. Идеал задаёт направление только там, где присутствует пространство. <br /> Идеал наполняет смыслом действия и связывает настоящее и будущее по принципу причины и следствия. Идеалист из множества хаотичных возможностей выбирает те, что ведут его к большой цели, структурируя свою жизнь и давая череде событий очертания великого пути.<br /><br /> Идеал не требует веры. Каждое событие, определённое идеалом, даёт результат в виде прибавки энергии, чувства гордости за себя, усиления <br />и оздоровления самооценки, ощущения роста и продукта деятельности, который хочется продемонстрировать и высоко поднять над головой.<br /><br /> Если же шаги, продиктованные стремлением к туманным перспективам, приносят разочарования, усталость, зависть…, <br />значит направление неверно и точкой стремления является сказка и фантазия. Длительное следование за иллюзией истощает существо <br />человека и приводит к фанатизму, слепой вере, которая позволяет снять напряжение только через передачу груза другому человеку. <br />Фанатик уверен, что действует верно, ведь он не истощается до конца, не желая замечать, за чей счёт продолжается движение.<br />'},
                {id: 2, title: 'Цена сказки', content: 'Если в процессе становления у человека была загублена способность стремиться, природная жажда к росту, мир получает амёбу.<br />Если в процессе становления человек не научился корректно оценивать реальность, мир получает фанатика.<br /><br />Амёба не делает ничего продуктивного. Фанатик разрушает мир, расходуя энергию некоторых амёб и будущих фанатиков для компенсации собственных убытков.<br /><br />Лишь идеалист способен производить, амёба и фанатик являются лишь потребителями. Паразиты позволяют себе насмешки над идеалами, которые являются основой их существования. «Идеал недостижим» ~ говорят они, подразумевая, что стремиться к лучшему, новому, большему нет необходимости, «идеал ~ это выдумка, картинка в голове человека» ~ говорят они, подразумевая, что человек не способен понимать закон причин <br />и следствий с помощью разума.<br /><br />А один из таких важнейших законов жизни: «Что не растёт, то погибает». Стагнация ~ это не равновесие, это размеренный упадок.<br />Отказ от идеалов ~ это не практичность, это смерть.<br /><br />С гордостью поднимите мечту ~ самый яркий признак жизни!<br /><br /><Strong>«–Если бы ты знала жизнь, полную высшего счастья и красоты, разве ты могла бы не возжелать вступить в неё? <br />–Но как могу я не мечтать, чтобы она была здесь, именно здесь?<br />–Мир наш тёмен и несовершенен, дитя моё. –Но почему в нём нет совершенства? Потому что его не может здесь быть? Или потому, что мы не хотим этого?»</Strong> <br /><br />(Эйн Рэнд, «Идеал»). '},
            ],
        }
    },
    components: {
        Card
    }
}
</script>

<style>
    
</style>