<template>
    <div id="HomePhilosophy" class="block-img img-1">
        <div class="container">
            <div class="block-grid-container">
                <Card 
                    v-for="data of card_data"
                    v-bind:data="data"
                    v-bind:key="data.id"
                />
            </div>
        </div>
    </div>
   
</template>

<script>
import Card from '@/components/Philosophy_Block_card.vue' 
export default {
    data(){
        return {
            card_data: [
                {id: 0, title: 'Зачем сохранять себя?', url: 'save-yourself', content: 'Фраза «будь собой» ясна, не вызывает разночтений в своей сути, не вызывает недопониманий, только человек доходит до вопроса к самому себе: «Как это»? <br/> Близость смысла фразы к истине даёт понять, что это естественное, необходимое и энергоэффективное состояние человека. <br/> <br/> Идея подразумевает, что каждый знает ответы на вопросы: «Что значит быть собой?» и «Как Я должен действовать?» <br/> (и извне никто ответить не способен). <br/> <br/> Однако мы живём в обществе, где людей... ' },
                {id: 1, title: 'Идеал ~ это не сказка', url: 'ideal-not-fairy', content: 'Фундаментальный первый шаг человека в предательстве себя ~ это отказ от идеалов. <br/> От мечтательности, потому что в детстве над мечтой слащаво умилялись, от героизма, потому что «жизнь полна несправедливости» и «добро побеждает только в сказках», от жажды сделать мир лучше, потому что «всё тлен». <br/> <br/> Идеализм с детства до получения красной картонки рубится под корень. <br/> Идеалы равняют с фанатизмом, наивностью и безрассудством, упрекая носителя. Идеалы осуждают, как крайность...'},
                {id: 3, title: 'Война идей', url: 'ideas-war', content: 'Начало войн, революций и репрессий, сопровождаемых физическим уничтожением, тянущих кровавый след смертей ~ это уже результат проигранной войны на фронте идей. Чтобы проследить эту мысль в крупных масштабах, необходимо проследить этот переход в существе отдельного человека. <br/> <br/> Человек, живущий созиданием, творчеством и производством, до последнего отказывается от насилия или физического противостояния с другим человеком, потому что осознаёт, что затраченные ресурсы и энергия...'},
            ],
            
        }
    },
    components: {
        Card
    }
}
</script>

<style>
    
</style>