<template>
    <div  id="HomeServices" class="block-img img-2">
        <div class="container">
            <div class="block-grid-container">
                <Card 
                    v-for="data of card_data"
                    v-bind:data="data"
                    v-bind:key="data.id"
                />
            </div>
        </div>
    </div>
</template>

<script>
import Card from '@/components/Services_Block_card.vue' 
export default {
    data(){
        return {
            card_data: [
                {id: 0, title: 'Менторство <br/> в выявлении пути', url: '', content: 'Человек на этапе становления, имея глубокую связь с внутренним голосом и огромные запасы энергии для формирования своего пути, способен справиться с отвлекающими факторами. <br /> <br />Польза на этапе прокладывания пути ~ экономия времени, сил, защита от заблуждений и инструменты для преодоления внешних препядствий. <br /> <br /> Менторство лучше всего подходит для подростков, юношей и девушек, молодых людей в возрасте от 14 до 21 года. <br /> <br /> Менторство предусматривает почти ежедневное общение и сопровождение. Менторство невозможно без личного, живого взаимодействия. <br /> <br /> Чтобы достичь максимальной пользы менторства, необходим минимум год совместного труда протеже и ментора.<br/>' },
                {id: 1, title: 'Оценка <br/> социального капитала ', url: '', content: 'Путёвый человек, который работает с постоянным коллективом, заинтересован в раскрытии потенциала отдельных личностей, в эффективной реализации человека в совместной деятельности и выявлении опасных соучастников. <br /> <br /> Когда возникает необходимость долгосрочного планирования и инвестирования в коллектив, пользой является раннее выявление перспектив каждого отдельного человека и последующий расчёт социального капитала.  <br /> <br /> Оценка подходит для бизнесменов, руководителей, для эффективного участника команды, вынужденного работать с неэффективными коллегами.  <br /> <br /> Оценка предусматривает доступ к коллективу во время всего цикла основной деятельности в течении 3-10 дней. Оценка невозможна без личного, живого взаимодействия. Может быть необходимость в проведении мероприятия.'},
                {id: 2, title: 'Выявление <br/> внутренних противоречий ', url: '', content: 'Человек, который стремится вернуться к себе, который отказывается себя терять и пытается искать пути для решения этой проблемы ~ непутёвый, но ещё живой. Непутёвым человек стал из-за множества противоречий, которые скопились в нём.  <br /> <br /> Их необходимо решать. Ключевая польза консультаций в фокусировке внимания на фундаментальных, критических и истощающих противоречиях.  <br /> <br /> Консультации подходят для тех, кто стал истощаться быстрее, чем восстанавливаться. Консультации подходят для тех, кто не видит смысла в психологах. Консультации необходимы тем, кто на волоске от того, чтобы потерять себя. <br /> <br /> Консультации могут быть онлайн и офлайн, но всегда персонально и уединённо в течении 1,5 часов. Проработка противоречий занимает от 1 до 10 встреч.<br/>'},
            ],
            
        }
    },
    components: {
        Card
    }
}
</script>

<style>
    
</style>